if UnitClassBase("player") ~= "DEATHKNIGHT" then return end
local addon, ns = ...
Fuyutsui.ClassBlocks = {
    [1] = {
        states = {
            ["状态"] = {
                "锚点",
                "职业",
                "专精",
                "队伍类型",
                "英雄天赋",
                "有效性",
                "一键辅助",
                "法术失败",
                "战斗时间",
                "移动",
                "施法",
                "引导",
                "蓄力",
                "蓄力层数",
                "生命值",
                "符文能量",
                "队伍人数",
                "首领战",
                "难度",
                "符文",
                "敌人人数",
            },
            ["目标"] = {
                "类型",
                "生命值",
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
            ["焦点"] = {
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
        },
        spells = {
            { spellId = 49576, name = "死亡之握" },
            { spellId = 51052, name = "反魔法领域" },
            { spellId = 221562, name = "窒息" },
            { spellId = 207167, name = "致盲冰雨" },
            { spellId = 46585, name = "亡者复生" },
            { spellId = 55233, name = "吸血鬼之血" },
            { spellId = 48792, name = "冰封之韧" },
            { spellId = 49039, name = "巫妖之躯" },
            { spellId = 108199, name = "血魔之握" },
            { spellId = 1263569, name = "憎恶附肢" },
            { spellId = 50, name = "吞噬" },
        },
    },
    [2] = {
        states = {
            ["状态"] = {
                "锚点",
                "职业",
                "专精",
                "队伍类型",
                "英雄天赋",
                "有效性",
                "一键辅助",
                "法术失败",
                "战斗时间",
                "移动",
                "施法",
                "引导",
                "蓄力",
                "蓄力层数",
                "生命值",
                "符文能量",
                "队伍人数",
                "首领战",
                "难度",
                "符文",
                "敌人人数",
                "爆发开关",
                "输出模式",
                "AOE开关",
                "爆发药水开关",
                "鲁莽药水冷却",
            },
            ["目标"] = {
                "类型",
                "生命值",
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
            ["焦点"] = {
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
        },
        -- TODO spellId: 黑暗援助
        -- TODO spellId: 杀戮机器
        -- TODO spellId: 白霜
        -- TODO spellId: 冰霜灾祸
        -- TODO spellId: 锋锐之霜
        -- TODO spellId: 冰霜之柱
        -- TODO spellId: 霜巢之眷
        -- TODO spellId: 霜巢之眷-冰霜巨龙之怒
        spells = {
            { spellId = 49576, name = "死亡之握" },
            { spellId = 51052, name = "反魔法领域" },
            { spellId = 221562, name = "窒息" },
            { spellId = 207167, name = "致盲冰雨" },
            { spellId = 51271, name = "冰霜之柱" },
            { spellId = 279302, name = "冰霜巨龙之怒" },
            { spellId = 439843, name = "死神印记" },
            { spellId = 47568, name = "符文武器增效" },
            { spellId = 47568, name = "符文武器增效", charge = true, maxCharge = 2 },
            { spellId = 1249658, name = "冰龙吐息" },
        },
    },
    [3] = {
        states = {
            ["状态"] = {
                "锚点",
                "职业",
                "专精",
                "队伍类型",
                "英雄天赋",
                "有效性",
                "一键辅助",
                "法术失败",
                "战斗时间",
                "移动",
                "施法",
                "引导",
                "蓄力",
                "蓄力层数",
                "生命值",
                "符文能量",
                "队伍人数",
                "首领战",
                "难度",
                "符文",
                "敌人人数",
                "爆发开关",
                "输出模式",
                "AOE开关",
                "疾病判断",
                "鲁莽药水冷却",
                "大红冷却",
                "爆发药水开关",
                "延迟",
                "天启骑士数量",
            },
            ["目标"] = {
                "类型",
                "生命值",
                "距离",
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
            ["焦点"] = {
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
        },
        -- TODO spellId: 次级食尸鬼
        -- TODO spellId: 割魂索命
        -- TODO spellId: 末日突降
        -- TODO spellId: 末日突降层数
        -- TODO spellId: 黑暗援助
        -- TODO spellId: 禁断知识
        -- TODO spellId: 脓疮毒镰
        -- TODO spellId: 脓疮毒镰2
        -- TODO spellId: 枯萎凋零
        -- TODO spellId: 亡者指挥官
        -- TODO spellId: 寒冰锁链
        -- TODO spellId: 暗影之爪层数
        -- TODO spellId: 凋萎
        spells = {
            { spellId = 49576, name = "死亡之握" },
            { spellId = 51052, name = "反魔法领域" },
            { spellId = 221562, name = "窒息" },
            { spellId = 207167, name = "致盲冰雨" },
            { spellId = 46584, name = "亡者复生" },
            { spellId = 42650, name = "亡者大军" },
            { spellId = 1247378, name = "腐化" },
            { spellId = 1247378, name = "腐化", charge = true, maxCharge = 3 },
            { spellId = 1233448, name = "黑暗突变" },
            { spellId = 343294, name = "灵魂收割" },
            { spellId = 43265, name = "枯萎凋零" },
            { spellId = 43265, name = "枯萎凋零", charge = true, maxCharge = 2 },
            { spellId = 55090, name = "天灾打击", castCount = 20 },
        },
    },
}

Fuyutsui.spellsList = {
    [384255]  = { index = 151, },              -- 切换天赋
    [200749]  = { index = 152, },              -- 切换专精
    -- 种族（主动技能；同类技能多职业变体共用同一 index）
    [28730]   = { index = 101, },              -- 奥术洪流(法师)
    [25046]   = { index = 101, },              -- 奥术洪流(潜行者)
    [50613]   = { index = 101, },              -- 奥术洪流(死亡骑士)
    [69179]   = { index = 101, },              -- 奥术洪流(战士)
    [80483]   = { index = 101, },              -- 奥术洪流(猎人)
    [129597]  = { index = 101, },              -- 奥术洪流(武僧)
    [155145]  = { index = 101, },              -- 奥术洪流(恶魔猎手)
    [202719]  = { index = 101, },              -- 奥术洪流(恶魔猎手)
    [232633]  = { index = 101, },              -- 奥术洪流(牧师)
    [20594]   = { index = 102, },              -- 矮人：石像形态
    [58984]   = { index = 103, },              -- 暗夜精灵：影遁
    [26297]   = { index = 104, },              -- 巨魔：狂暴
    [20572]   = { index = 105, },              -- 兽人：血性狂怒(攻击强度)
    [33697]   = { index = 105, },              -- 兽人：血性狂怒(双属性)
    [33702]   = { index = 105, },              -- 兽人：血性狂怒(法术强度)
    [20549]   = { index = 106, },              -- 牛头人：战争践踏
    [59752]   = { index = 107, },              -- 人类：生存意志
    [7744]    = { index = 108, },              -- 亡灵：亡灵意志
    [20589]   = { index = 109, },              -- 侏儒：逃命专家
    [68992]   = { index = 110, },              -- 狼人：黑暗飞行
    [69070]   = { index = 111, },              -- 地精：火箭跳
    [69041]   = { index = 112, },              -- 地精：火箭弹幕
    [256948]  = { index = 113, },              -- 虚空精灵：空间裂隙
    [255647]  = { index = 114, },              -- 光铸德莱尼：圣光裁决
    [274738]  = { index = 115, },              -- 玛格汉兽人：先祖召唤
    [265221]  = { index = 116, },              -- 黑铁矮人：烈焰之血
    [255654]  = { index = 117, },              -- 高山牛头人：蛮牛冲撞
    [255723]  = { index = 117, },              -- 高山牛头人：蛮牛冲撞
    [260364]  = { index = 118, },              -- 夜之子：奥术脉冲
    [312411]  = { index = 119, },              -- 狐人：袋里乾坤
    [291944]  = { index = 120, },              -- 赞达拉巨魔：再生
    [107079]  = { index = 121, },              -- 熊猫人：震山掌
    [28880]   = { index = 122, },              -- 德莱尼：纳鲁的赐福(战士)
    [59542]   = { index = 122, },              -- 纳鲁的赐福(圣骑士)
    [59543]   = { index = 122, },              -- 纳鲁的赐福(猎人)
    [59544]   = { index = 122, },              -- 纳鲁的赐福(牧师)
    [59545]   = { index = 122, },              -- 纳鲁的赐福(死亡骑士)
    [59547]   = { index = 122, },              -- 纳鲁的赐福(萨满)
    [121093]  = { index = 122, },              -- 纳鲁的赐福(武僧)
    [287712]  = { index = 123, },              -- 库尔提拉斯人：重拳出击
    [312924]  = { index = 124, },              -- 机械侏儒：超有机光发起源
    [368970]  = { index = 125, },              -- 龙希尔：扫尾
    [357214]  = { index = 126, },              -- 龙希尔：翼击
    [436344]  = { index = 127, },              -- 土灵：艾泽里特涌动
    -- 死亡骑士
    [51052]   = { index = 1, failed = true },  -- 反魔法领域
    [221562]  = { index = 2, failed = true },  -- 窒息
    [207167]  = { index = 3, failed = true },  -- 致盲冰雨
    [42650]   = { index = 4, failed = true },  -- 亡者大军
    [206930]  = { index = 5, },                -- 心脏打击
    [43265]   = { index = 6, },                -- 枯萎凋零
    [195292]  = { index = 7, },                -- 死神的抚摸
    [49998]   = { index = 8, },                -- 灵界打击
    [49028]   = { index = 9, },                -- 符文刃舞
    [195182]  = { index = 10, },               -- 精髓分裂
    [50842]   = { index = 11, },               -- 血液沸腾
    [433895]  = { index = 12, },               -- 吸血鬼打击
    [46584]   = { index = 13, },               -- 亡者复生
    [47541]   = { index = 14, },               -- 凋零缠绕
    [55090]   = { index = 15, },               -- 天灾打击
    [207317]  = { index = 16, },               -- 扩散
    [77575]   = { index = 17, },               -- 爆发
    [85948]   = { index = 18, },               -- 脓疮打击
    [1247378] = { index = 19, },               -- 腐化
    [1233448] = { index = 20, },               -- 黑暗突变
    [343294]  = { index = 21, },               -- 灵魂收割
    [458128]  = { index = 22, },               -- 脓疮毒镰
    [108199]  = { index = 23, failed = true }, -- 血魔之握
    [1263569] = { index = 24, failed = true }, -- 憎恶附肢
    [439843]  = { index = 25, },               -- 死神印记
    [194913]  = { index = 26, },               -- 冰川突进
    [279302]  = { index = 27, },               -- 冰霜巨龙之怒
    [196770]  = { index = 28, },               -- 冷酷严冬
    [51271]   = { index = 29, },               -- 冰霜之柱
    [49143]   = { index = 30, },               -- 冰霜打击
    [49184]   = { index = 31, },               -- 凛风冲击
    [207230]  = { index = 32, },               -- 冰霜之镰
    [1249685] = { index = 33, },               -- 冰龙吐息
    [49020]   = { index = 34, },               -- 湮灭
    [47568]   = { index = 35, },               -- 符文武器增效
    [316239]  = { index = 36, },               -- 符文打击
    [1265384] = { index = 37, },               -- 冰霜巨龙之怒
    [1228433] = { index = 38, },               -- 冰霜灾祸
    [49576]   = { index = 39, failed = true }, -- 死亡之握
    [1263824] = { index = 40 },                -- 吞噬
    [383269]  = { index = 41 },                -- 灾殃坟茔
    [1242174] = { index = 42 },                -- 死灵缠绕
}
