if UnitClassBase("player") ~= "DEMONHUNTER" then return end
local addon, ns = ...
Fuyutsui.ClassBlocks = {
    [1] = {
        states = {
            ["状态"] = {
                "锚点",
                "职业",
                "专精",
                "队伍类型",
                "英雄天赋",
                "有效性",
                "一键辅助",
                "法术失败",
                "战斗时间",
                "移动",
                "施法",
                "引导",
                "蓄力",
                "蓄力层数",
                "生命值",
                "恶魔之怒",
                "队伍人数",
                "首领战",
                "难度",
                "敌人人数",
            },
            ["目标"] = {
                "类型",
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
            ["焦点"] = {
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
        },
        spells = {
            { spellId = 196718, name = "黑暗" },
            { spellId = 198793, name = "复仇回避" },
            { spellId = 185123, name = "投掷利刃 " },
            { spellId = 185123, name = "投掷利刃", charge = true },
            { spellId = 207684, name = "悲苦咒符" },
            { spellId = 217832, name = "禁锢" },
            { spellId = 258920, name = "献祭光环" },
            { spellId = 179057, name = "混乱新星" },
            { spellId = 191427, name = "恶魔变形" },
            { spellId = 232893, name = "邪能之刃" },
            { spellId = 188499, name = "刃舞" },
            { spellId = 162794, name = "混乱打击" },
            { spellId = 198589, name = "疾影" },
            { spellId = 370965, name = "恶魔追击" },
            { spellId = 198013, name = "眼棱" },
            { spellId = 195072, name = "邪能冲撞" },
            { spellId = 258860, name = "精华破碎" },
        },
    },
    [2] = {
        states = {
            ["状态"] = {
                "锚点",
                "职业",
                "专精",
                "队伍类型",
                "英雄天赋",
                "有效性",
                "一键辅助",
                "法术失败",
                "战斗时间",
                "移动",
                "施法",
                "引导",
                "蓄力",
                "蓄力层数",
                "生命值",
                "恶魔之怒",
                "队伍人数",
                "首领战",
                "难度",
                "敌人人数",
            },
            ["目标"] = {
                "类型",
                "施法",
                "引导",
                "施法可打断",
                "引导可打断",
            },
            ["焦点"] = {
                "施法",
                "引导",
                "施法可打断",
                "引导可打断",
            },
        },
        -- TODO spellId: 无羁邪怒
        spells = {
            { spellId = 196718, name = "黑暗" },
            { spellId = 198793, name = "复仇回避" },
            { spellId = 185123, name = "投掷利刃 " },
            { spellId = 185123, name = "投掷利刃", charge = true, maxCharge = 2 },
            { spellId = 207684, name = "悲苦咒符" },
            { spellId = 217832, name = "禁锢" },
            { spellId = 258920, name = "献祭光环" },
            { spellId = 179057, name = "混乱新星" },
            { spellId = 187827, name = "恶魔变形" },
            { spellId = 232893, name = "邪能之刃" },
            { spellId = 189110, name = "地狱火撞击" },
            { spellId = 189110, name = "地狱火撞击", charge = true, maxCharge = 2 },
            { spellId = 203720, name = "恶魔尖刺" },
            { spellId = 204021, name = "烈火烙印" },
            { spellId = 204021, name = "烈火烙印", charge = true, maxCharge = 2 },
            { spellId = 247454, name = "幽魂炸弹" },
            { spellId = 207407, name = "灵魂切削" },
            { spellId = 204596, name = "烈焰咒符" },
            { spellId = 390163, name = "怨念咒符" },
            { spellId = 228447, name = "灵魂裂劈" },
            { spellId = 263642, name = "破裂" },
            { spellId = 263642, name = "破裂", charge = true, maxCharge = 2 },
            { spellId = 212084, name = "邪能毁灭" },
            { spellId = 202137, name = "沉默咒符" },
            { spellId = 228477, name = "灵魂裂劈", castCount = 6 },
        },
    },
    [3] = {
        states = {
            ["状态"] = {
                "锚点",
                "职业",
                "专精",
                "队伍类型",
                "英雄天赋",
                "有效性",
                "一键辅助",
                "法术失败",
                "战斗时间",
                "移动",
                "施法",
                "引导",
                "蓄力",
                "蓄力层数",
                "生命值",
                "恶魔之怒",
                "队伍人数",
                "首领战",
                "难度",
                "敌人人数",
            },
            ["目标"] = {
                "类型",
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
            ["焦点"] = {
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
        },
        spells = {
            { spellId = 196718, name = "黑暗" },
            { spellId = 198793, name = "复仇回避" },
            { spellId = 185123, name = "投掷利刃 " },
            { spellId = 185123, name = "投掷利刃", charge = true },
            { spellId = 207684, name = "悲苦咒符" },
            { spellId = 217832, name = "禁锢" },
            { spellId = 258920, name = "献祭光环" },
            { spellId = 1234195, name = "虚空新星" },
            { spellId = 1217605, name = "虚空变形", castCount = 50 },
            { spellId = 1245412, name = "虚空之刃" },
            { spellId = 1234796, name = "变换 " },
            { spellId = 1234796, name = "变换", charge = true },
            { spellId = 1226019, name = "收割" },
            { spellId = 473662, name = "吞噬" },
            { spellId = 198589, name = "疾影" },
            { spellId = 473728, name = "虚空射线" },
            { spellId = 1246167, name = "恶魔追击" },
            { spellId = 1239123, name = "饥渴斩击" },
            { spellId = 1245453, name = "剔除" },
        },
    },
}

Fuyutsui.spellsList = {

    [384255]  = { index = 151, },              -- 切换天赋
    [200749]  = { index = 152, },              -- 切换专精
    -- 种族
    [59547]   = { index = 122, },              -- 纳鲁的赐福
    [28730]   = { index = 101, },              -- 奥术洪流(法师)
    [232633]  = { index = 101, },              -- 奥术洪流(牧师)
    [129597]  = { index = 101, },              -- 奥术洪流(武僧)
    -- 恶魔猎手
    [198793]  = { index = 1, },                -- 复仇回避
    [185123]  = { index = 2, },                -- 投掷利刃
    [207684]  = { index = 3, failed = true },  -- 悲苦咒符
    [217832]  = { index = 4 },                 -- 禁锢
    [258920]  = { index = 5, },                -- 献祭光环
    [179057]  = { index = 6, failed = true },  -- 混乱新星
    [191427]  = { index = 7, },                -- 恶魔变形
    [232893]  = { index = 8, },                -- 邪能之刃
    [188499]  = { index = 9, },                -- 刃舞
    [162794]  = { index = 10, },               -- 混乱打击
    [198589]  = { index = 11, },               -- 疾影
    [370965]  = { index = 12, },               -- 恶魔追击
    [198013]  = { index = 13, },               -- 眼棱
    [195072]  = { index = 14, },               -- 邪能冲撞
    [258860]  = { index = 15, },               -- 精华破碎
    [187827]  = { index = 16, failed = true }, -- 恶魔变形
    [189110]  = { index = 17, },               -- 地狱火撞击
    [203720]  = { index = 18, },               -- 恶魔尖刺
    [204021]  = { index = 19 },                -- 烈火烙印
    [247454]  = { index = 20, },               -- 幽魂炸弹
    [207407]  = { index = 21, },               -- 灵魂切削
    [204596]  = { index = 22, },               -- 烈焰咒符
    [390163]  = { index = 23, },               -- 怨念咒符
    [228477]  = { index = 24, },               -- 灵魂裂劈
    [263642]  = { index = 25, },               -- 破裂
    [212084]  = { index = 26, failed = true }, -- 邪能毁灭
    [202137]  = { index = 27, failed = true }, -- 沉默咒符
    [1234195] = { index = 28, failed = true }, -- 虚空新星
    [1217605] = { index = 29, },               -- 虚空变形
    [1245412] = { index = 30, },               -- 虚空之刃
    [1234796] = { index = 31, },               -- 变换
    [1226019] = { index = 32, },               -- 收割
    [473662]  = { index = 33, },               -- 吞噬
    [473728]  = { index = 34, },               -- 虚空射线
    [1246167] = { index = 35, },               -- 恶魔追击
    [1239123] = { index = 36, },               -- 饥渴斩击
    [1245453] = { index = 37, },               -- 剔除
    [201427]  = { index = 38, },               -- 毁灭(混乱打击)
    [210152]  = { index = 39, },               -- 死亡横扫(刃舞)
    [452487]  = { index = 40, },               -- 吞噬之焰(献祭光环)
    [427917]  = { index = 41, },               -- 献祭光环
    [204157]  = { index = 42, },               -- 投掷利刃
    [196718]  = { index = 43, failed = true }, -- 黑暗
    [1217610] = { index = 44, },               -- 吞噬(虚空变形)
    [1221150] = { index = 45 },                -- 坍缩之星
    [1225826] = { index = 46, },               -- 根除
    [1241937] = { index = 47, },               -- 灵魂献祭
    [452497]  = { index = 48, },               -- 深渊凝视(眼棱)
    [213243]  = { index = 49, },               -- 邪能之刃
    [227518]  = { index = 50, },               -- 毁灭
    [201428]  = { index = 51, },               -- 毁灭
    [222031]  = { index = 52, },               -- 混乱打击
    [199547]  = { index = 53, },               -- 混乱打击
    [201453]  = { index = 54, },               -- 恶魔变形
    [200166]  = { index = 55, },               -- 恶魔变形
    [456640]  = { index = 56, },               -- 吞噬之焰
}
