if UnitClassBase("player") ~= "DRUID" then return end
local addon, ns = ...
Fuyutsui.ClassBlocks = {
    [1] = {
        states = {
            ["状态"] = {
                "锚点",
                "职业",
                "专精",
                "队伍类型",
                "英雄天赋",
                "有效性",
                "一键辅助",
                "法术失败",
                "战斗时间",
                "移动",
                "施法",
                "引导",
                "蓄力",
                "蓄力层数",
                "生命值",
                "能量值",
                "队伍人数",
                "首领战",
                "难度",
                "敌人人数",
                "姿态",
            },
            ["目标"] = {
                "类型",
                "生命值",
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
            ["焦点"] = {
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
        },
        spells = {
            { spellId = 22812, name = "树皮术" },
            { spellId = 132469, name = "台风" },
            { spellId = 99, name = "夺魂咆哮" },
            { spellId = 29166, name = "激活" },
            { spellId = 102793, name = "乌索尔旋风" },
            { spellId = 78675, name = "日光术" },
        },
    },
    [2] = {
        states = {
            ["状态"] = {
                "锚点",
                "职业",
                "专精",
                "队伍类型",
                "英雄天赋",
                "有效性",
                "一键辅助",
                "法术失败",
                "战斗时间",
                "移动",
                "施法",
                "引导",
                "蓄力",
                "蓄力层数",
                "生命值",
                "能量值",
                "队伍人数",
                "首领战",
                "难度",
                "敌人人数",
                "姿态",
            },
            ["目标"] = {
                "类型",
                "生命值",
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
            ["焦点"] = {
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
        },
        spells = {
            { spellId = 22812, name = "树皮术" },
            { spellId = 132469, name = "台风" },
            { spellId = 99, name = "夺魂咆哮" },
            { spellId = 29166, name = "激活" },
            { spellId = 102793, name = "乌索尔旋风" },
        },
    },
    [3] = {
        states = {
            ["状态"] = {
                "锚点",
                "职业",
                "专精",
                "队伍类型",
                "英雄天赋",
                "有效性",
                "一键辅助",
                "法术失败",
                "战斗时间",
                "移动",
                "施法",
                "引导",
                "蓄力",
                "蓄力层数",
                "生命值",
                "能量值",
                "队伍人数",
                "首领战",
                "难度",
                "敌人人数",
                "姿态",
            },
            ["目标"] = {
                "类型",
                "生命值",
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
            ["焦点"] = {
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
        },
        -- TODO spellId: 塞纳留斯的梦境
        -- TODO spellId: 塞纳留斯的梦境层数
        -- TODO spellId: 铁鬃
        -- TODO spellId: 狂暴回复
        -- TODO spellId: 星河守护者
        -- TODO spellId: 淤血
        spells = {
            { spellId = 22812, name = "树皮术" },
            { spellId = 132469, name = "台风" },
            { spellId = 99, name = "夺魂咆哮" },
            { spellId = 29166, name = "激活" },
            { spellId = 102793, name = "乌索尔旋风" },
            { spellId = 22842, name = "狂暴回复" },
            { spellId = 22842, name = "狂暴回复", charge = true },
            { spellId = 61336, name = "生存本能" },
            { spellId = 102558, name = "化身：乌索克的守护者" },
            { spellId = 1261867, name = "野性之心" },
            { spellId = 1253799, name = "碎甲咆哮" },
            { spellId = 1252871, name = "赤红之月" },
            { spellId = 6807, name = "重殴" },
            { spellId = 77758, name = "痛击" },
        },
    },
    [4] = {
        states = {
            ["状态"] = {
                "锚点",
                "职业",
                "专精",
                "队伍类型",
                "英雄天赋",
                "有效性",
                "一键辅助",
                "法术失败",
                "战斗时间",
                "移动",
                "施法",
                "引导",
                "蓄力",
                "蓄力层数",
                "生命值",
                "法力值",
                "队伍人数",
                "首领战",
                "难度",
                "姿态",
                "连击点",
                "施法技能",
            },
            ["目标"] = {
                "类型",
                "距离",
                "施法",
                "施法可打断",
            },
        },
        -- TODO spellId: 节能施法
        -- TODO spellId: 丛林之魂
        spells = {
            { spellId = 22812, name = "树皮术" },
            { spellId = 132469, name = "台风" },
            { spellId = 99, name = "夺魂咆哮" },
            { spellId = 29166, name = "激活" },
            { spellId = 102793, name = "乌索尔旋风" },
            { spellId = 18562, name = "迅捷治愈" },
            { spellId = 18562, name = "迅捷治愈", charge = true },
            { spellId = 48438, name = "野性成长" },
            { spellId = 391528, name = "万灵之召" },
            { spellId = 88423, name = "自然之愈" },
            { spellId = 102342, name = "铁木树皮" },
            { spellId = 132158, name = "自然迅捷" },
            { spellId = 1261867, name = "野性之心" },
        },
        group = {
            num = 7,
            healthPercent = 1,
            role = 2,
        },
    },
}

Fuyutsui.spellsList = {
    [384255]  = { index = 151, },              -- 切换天赋
    [200749]  = { index = 152, },              -- 切换专精
    -- 种族（主动技能；同类技能多职业变体共用同一 index）
    [28730]   = { index = 101, },              -- 奥术洪流(法师)
    [25046]   = { index = 101, },              -- 奥术洪流(潜行者)
    [50613]   = { index = 101, },              -- 奥术洪流(死亡骑士)
    [69179]   = { index = 101, },              -- 奥术洪流(战士)
    [80483]   = { index = 101, },              -- 奥术洪流(猎人)
    [129597]  = { index = 101, },              -- 奥术洪流(武僧)
    [155145]  = { index = 101, },              -- 奥术洪流(恶魔猎手)
    [202719]  = { index = 101, },              -- 奥术洪流(恶魔猎手)
    [232633]  = { index = 101, },              -- 奥术洪流(牧师)
    [20594]   = { index = 102, },              -- 矮人：石像形态
    [58984]   = { index = 103, },              -- 暗夜精灵：影遁
    [26297]   = { index = 104, },              -- 巨魔：狂暴
    [20572]   = { index = 105, },              -- 兽人：血性狂怒(攻击强度)
    [33697]   = { index = 105, },              -- 兽人：血性狂怒(双属性)
    [33702]   = { index = 105, },              -- 兽人：血性狂怒(法术强度)
    [20549]   = { index = 106, },              -- 牛头人：战争践踏
    [59752]   = { index = 107, },              -- 人类：生存意志
    [7744]    = { index = 108, },              -- 亡灵：亡灵意志
    [20589]   = { index = 109, },              -- 侏儒：逃命专家
    [68992]   = { index = 110, },              -- 狼人：黑暗飞行
    [69070]   = { index = 111, },              -- 地精：火箭跳
    [69041]   = { index = 112, },              -- 地精：火箭弹幕
    [256948]  = { index = 113, },              -- 虚空精灵：空间裂隙
    [255647]  = { index = 114, },              -- 光铸德莱尼：圣光裁决
    [274738]  = { index = 115, },              -- 玛格汉兽人：先祖召唤
    [265221]  = { index = 116, },              -- 黑铁矮人：烈焰之血
    [255654]  = { index = 117, },              -- 高山牛头人：蛮牛冲撞
    [255723]  = { index = 117, },              -- 高山牛头人：蛮牛冲撞
    [260364]  = { index = 118, },              -- 夜之子：奥术脉冲
    [312411]  = { index = 119, },              -- 狐人：袋里乾坤
    [291944]  = { index = 120, },              -- 赞达拉巨魔：再生
    [107079]  = { index = 121, },              -- 熊猫人：震山掌
    [28880]   = { index = 122, },              -- 德莱尼：纳鲁的赐福(战士)
    [59542]   = { index = 122, },              -- 纳鲁的赐福(圣骑士)
    [59543]   = { index = 122, },              -- 纳鲁的赐福(猎人)
    [59544]   = { index = 122, },              -- 纳鲁的赐福(牧师)
    [59545]   = { index = 122, },              -- 纳鲁的赐福(死亡骑士)
    [59547]   = { index = 122, },              -- 纳鲁的赐福(萨满)
    [121093]  = { index = 122, },              -- 纳鲁的赐福(武僧)
    [287712]  = { index = 123, },              -- 库尔提拉斯人：重拳出击
    [312924]  = { index = 124, },              -- 机械侏儒：超有机光发起源
    [368970]  = { index = 125, },              -- 龙希尔：扫尾
    [357214]  = { index = 126, },              -- 龙希尔：翼击
    [436344]  = { index = 127, },              -- 土灵：艾泽里特涌动
    -- 德鲁伊
    [132469]  = { index = 1, failed = true },  -- 台风
    [99]      = { index = 2, failed = true },  -- 夺魂咆哮
    [102793]  = { index = 3, failed = true },  -- 乌索尔旋风
    [132158]  = { index = 4 },                 -- 自然迅捷
    [8921]    = { index = 5, },                -- 月火术
    [1126]    = { index = 6, },                -- 野性印记
    [400254]  = { index = 7, },                -- 摧折
    [204066]  = { index = 8, },                -- 明月普照
    [213771]  = { index = 9, },                -- 横扫
    [5487]    = { index = 10, },               -- 熊形态
    [77758]   = { index = 11, },               -- 痛击
    [33917]   = { index = 12, },               -- 裂伤
    [1252871] = { index = 13, },               -- 赤红之月
    [441605]  = { index = 14, },               -- 毁灭
    [22568]   = { index = 15, },               -- 凶猛撕咬
    [1079]    = { index = 16, },               -- 割裂
    [5221]    = { index = 17, },               -- 撕碎
    [1822]    = { index = 18, },               -- 斜掠
    [5176]    = { index = 19, },               -- 愤怒
    [8936]    = { index = 20, },               -- 愈合
    [48438]   = { index = 21, },               -- 野性生长
    [740]     = { index = 22, },               -- 宁静
    [190984]  = { index = 23, },               -- 愤怒
    [78674]   = { index = 24, },               -- 星涌术
    [194153]  = { index = 25, },               -- 星火术
    [391528]  = { index = 26, },               -- 万灵之召
    [191034]  = { index = 27, },               -- 星辰坠落
    [205636]  = { index = 28, },               -- 自然之力
    [1233346] = { index = 29, },               -- 日蚀
    [194223]  = { index = 30, },               -- 超凡之盟
    [78675]   = { index = 31, failed = true }, -- 日光术
    [102560]  = { index = 32, },               -- 化身：艾露恩之眷
    [202770]  = { index = 33, },               -- 艾露恩之怒
    [274281]  = { index = 34, },               -- 新月
    [24858]   = { index = 35, },               -- 枭兽形态
    [93402]   = { index = 36, },               -- 阳炎术
    [1233272] = { index = 37, },               -- 月蚀
    [768]     = { index = 38, },               -- 猎豹形态
    [102543]  = { index = 39, },               -- 化身：阿莎曼之灵
    [285381]  = { index = 40, },               -- 原始之怒
    [106839]  = { index = 41, },               -- 迎头痛击
    [1243807] = { index = 42, },               -- 怒意狂乱
    [5217]    = { index = 43, },               -- 猛虎之怒
    [61336]   = { index = 44, },               -- 生存本能
    [102401]  = { index = 45, },               -- 野性冲锋
    [102359]  = { index = 46, },               -- 群体缠绕
    [106951]  = { index = 47, },               -- 狂暴
    [1244258] = { index = 48, },               -- 啃噬
    [274837]  = { index = 49, },               -- 野性狂乱
    [106785]  = { index = 50, },               -- 横扫
    [441591]  = { index = 51, },               -- 毁灭
    [1253799] = { index = 52, },               -- 碎甲咆哮
    [6807]    = { index = 53, },               -- 重殴
    [1261867] = { index = 54, },               -- 野性之心
    [93985]   = { index = 55, },               -- 迎头痛击
    [314330]  = { index = 56, },               -- 迎头痛击
    [192081]  = { index = 57, },               -- 铁鬃
    [1270292] = { index = 58, },               -- 明月普照
    [22812]   = { index = 59, },               -- 树皮术
    [2908]    = { index = 60, },               -- 安抚
    [1850]    = { index = 61, },               -- 急奔
    [339]     = { index = 62, },               -- 纠缠根须
    [2782]    = { index = 63, },               -- 清除腐蚀
    [6795]    = { index = 64, },               -- 低吼
    [77761]   = { index = 65, },               -- 狂奔怒吼
    [783]     = { index = 66, },               -- 旅行形态
    [102558]  = { index = 67, },               -- 化身：乌索克的守护者
    [77764]   = { index = 68, },               -- 狂奔怒吼
}
