if UnitClassBase("player") ~= "EVOKER" then return end
local addon, ns = ...
Fuyutsui.ClassBlocks = {
    [1] = {
        states = {
            ["状态"] = {
                "锚点",
                "职业",
                "专精",
                "队伍类型",
                "英雄天赋",
                "有效性",
                "一键辅助",
                "法术失败",
                "战斗时间",
                "移动",
                "施法",
                "引导",
                "蓄力",
                "蓄力层数",
                "生命值",
                "能量值",
                "队伍人数",
                "首领战",
                "难度",
                "施法技能",
            },
            ["目标"] = {
                "类型",
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
            ["焦点"] = {
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
        },
        spells = {
            { spellId = 365585, name = "净除" },
            { spellId = 363916, name = "黑曜鳞片" },
            { spellId = 363916, name = "黑曜鳞片", charge = true },
            { spellId = 358385, name = "山崩" },
            { spellId = 360995, name = "青翠之拥" },
            { spellId = 357210, name = "深呼吸" },
            { spellId = 374227, name = "微风" },
            { spellId = 358267, name = "悬空" },
            { spellId = 358267, name = "悬空", charge = true },
            { spellId = 368970, name = "扫尾" },
            { spellId = 370553, name = "扭转天平" },
            { spellId = 370665, name = "营救" },
            { spellId = 374968, name = "时间螺旋" },
            { spellId = 406732, name = "空间悖论" },
            { spellId = 359073, name = "永恒之涌" },
            { spellId = 351338, name = "镇压" },
            { spellId = 375087, name = "狂龙之怒" },
            { spellId = 357208, name = "火焰吐息" },
        },
    },
    [2] = {
        states = {
            ["状态"] = {
                "锚点",
                "职业",
                "专精",
                "队伍类型",
                "英雄天赋",
                "有效性",
                "一键辅助",
                "法术失败",
            },
        },
    },
    [3] = {
        states = {
            ["状态"] = {
                "锚点",
                "职业",
                "专精",
                "队伍类型",
                "英雄天赋",
                "有效性",
                "一键辅助",
                "法术失败",
                "战斗时间",
                "移动",
                "施法",
                "引导",
                "蓄力",
                "蓄力层数",
                "生命值",
                "能量值",
                "队伍人数",
                "首领战",
                "难度",
                "施法技能",
                "精华能量",
            },
            ["目标"] = {
                "类型",
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
            ["焦点"] = {
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
        },
        spells = {
            { spellId = 365585, name = "净除" },
            { spellId = 363916, name = "黑曜鳞片" },
            { spellId = 363916, name = "黑曜鳞片", charge = true },
            { spellId = 358385, name = "山崩" },
            { spellId = 360995, name = "青翠之拥" },
            { spellId = 357210, name = "深呼吸" },
            { spellId = 374227, name = "微风" },
            { spellId = 358267, name = "悬空" },
            { spellId = 358267, name = "悬空", charge = true },
            { spellId = 368970, name = "扫尾" },
            { spellId = 370553, name = "扭转天平" },
            { spellId = 370665, name = "营救" },
            { spellId = 374968, name = "时间螺旋" },
            { spellId = 406732, name = "空间悖论" },
            { spellId = 357208, name = "火焰吐息" },
            { spellId = 396286, name = "地壳激变" },
            { spellId = 409311, name = "先知先觉" },
            { spellId = 395152, name = "黑檀之力" },
            { spellId = 442204, name = "亘古吐息" },
            { spellId = 409311, name = "先知先觉", charge = true },
        },
        group = {
            num = 5,
            healthPercent = 1,
            role = 2,
        },
    },
}

Fuyutsui.spellsList = {

    [384255]  = { index = 151, },              -- 切换天赋
    [200749]  = { index = 152, },              -- 切换专精
    -- 种族
    [59547]   = { index = 122, },              -- 纳鲁的赐福
    [28730]   = { index = 101, },              -- 奥术洪流(法师)
    [232633]  = { index = 101, },              -- 奥术洪流(牧师)
    [129597]  = { index = 101, },              -- 奥术洪流(武僧)
    -- 唤魔师
    [365585]  = { index = 1, },                -- 净除
    [382266]  = { index = 2, },                -- 火焰吐息
    [364342]  = { index = 3, },                -- 青铜龙的祝福
    [374251]  = { index = 4, },                -- 灼烧之焰
    [363916]  = { index = 5, },                -- 黑曜鳞片
    [358385]  = { index = 6, },                -- 山崩
    [358267]  = { index = 7, },                -- 悬空
    [362969]  = { index = 8, },                -- 碧蓝打击
    [368970]  = { index = 9, },                -- 扫尾
    [355913]  = { index = 10, },               -- 翡翠之花
    [370553]  = { index = 11, },               -- 扭转天平
    [361469]  = { index = 12, },               -- 活化烈焰
    [356995]  = { index = 13, },               -- 裂解
    [357210]  = { index = 14, },               -- 深呼吸
    [360995]  = { index = 15, },               -- 青翠之拥
    [382411]  = { index = 16, },               -- 永恒之涌
    [357211]  = { index = 17, },               -- 葬火
    [375087]  = { index = 18, },               -- 狂龙之怒
    [351338]  = { index = 19, },               -- 镇压
    [360806]  = { index = 20, },               -- 梦游
    [374227]  = { index = 21, },               -- 微风
    [374968]  = { index = 22, },               -- 时间螺旋
    [406732]  = { index = 23, },               -- 空间悖论
    [370665]  = { index = 24, },               -- 营救
    [1265872] = { index = 25, },               -- 碧蓝横扫(碧蓝打击)
    [357208]  = { index = 26, },               -- 火焰吐息
    [359073]  = { index = 27, },               -- 永恒之涌
}
