if UnitClassBase("player") ~= "HUNTER" then return end
local addon, ns = ...
Fuyutsui.ClassBlocks = {
    [1] = {
        states = {
            ["状态"] = {
                "锚点",
                "职业",
                "专精",
                "队伍类型",
                "英雄天赋",
                "有效性",
                "一键辅助",
                "法术失败",
                "战斗时间",
                "移动",
                "施法",
                "引导",
                "蓄力",
                "蓄力层数",
                "生命值",
                "队伍人数",
                "首领战",
                "难度",
                "敌人人数",
            },
            ["能量"] = {
                "集中值",
            },
            ["配置开关"] = {
                "爆发开关",
                "输出模式",
                "AOE开关",
            },
            ["目标"] = {
                "类型",
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
            ["焦点"] = {
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
        },
        -- TODO spellId: 自然之友
        -- TODO spellId: 猎人印记
        -- TODO spellId: 狂野怒火光环
        spells = {
            { spellId = 53480, name = "牺牲咆哮" },
            { spellId = 109304, name = "意气风发" },
            { spellId = 19577, name = "胁迫" },
            { spellId = 5116, name = "震荡射击" },
            { spellId = 19801, name = "宁神射击" },
            { spellId = 187698, name = "焦油陷进" },
            { spellId = 1513, name = "恐吓野兽" },
            { spellId = 109248, name = "束缚射击" },
            { spellId = 195645, name = "摔绊" },
            { spellId = 34026, name = "杀戮命令" },
            { spellId = 34026, name = "杀戮命令", charge = true },
            { spellId = 217200, name = "倒刺射击" },
            { spellId = 217200, name = "倒刺射击", charge = true },
            { spellId = 147362, name = "反制射击" },
            { spellId = 19574, name = "狂野怒火" },
            { spellId = 1264359, name = "狂野鞭笞" },
        },
    },
    [2] = {
        states = {
            ["状态"] = {
                "锚点",
                "职业",
                "专精",
                "队伍类型",
                "英雄天赋",
                "有效性",
                "一键辅助",
                "法术失败",
                "战斗时间",
                "移动",
                "施法",
                "引导",
                "蓄力",
                "蓄力层数",
                "生命值",
                "队伍人数",
                "首领战",
                "难度",
            },
            ["能量"] = {
                "集中值",
            },
            ["目标"] = {
                "类型",
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
            ["焦点"] = {
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
        },
        spells = {
            { spellId = 53480, name = "牺牲咆哮" },
            { spellId = 109304, name = "意气风发" },
            { spellId = 19577, name = "胁迫" },
            { spellId = 5116, name = "震荡射击" },
            { spellId = 19801, name = "宁神射击" },
            { spellId = 187698, name = "焦油陷进" },
            { spellId = 1513, name = "恐吓野兽" },
            { spellId = 109248, name = "束缚射击" },
            { spellId = 195645, name = "摔绊" },
            { spellId = 147362, name = "反制射击" },
            { spellId = 19434, name = "瞄准射击" },
            { spellId = 19434, name = "瞄准射击", charge = true },
            { spellId = 257044, name = "急速射击" },
            { spellId = 288613, name = "百发百中" },
        },
    },
    [3] = {
        states = {
            ["状态"] = {
                "锚点",
                "职业",
                "专精",
                "队伍类型",
                "英雄天赋",
                "有效性",
                "一键辅助",
                "法术失败",
                "战斗时间",
                "移动",
                "施法",
                "引导",
                "蓄力",
                "蓄力层数",
                "生命值",
                "队伍人数",
                "首领战",
                "难度",
            },
            ["能量"] = {
                "集中值",
            },
            ["目标"] = {
                "类型",
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
            ["焦点"] = {
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
        },
        spells = {
            { spellId = 53480, name = "牺牲咆哮" },
            { spellId = 109304, name = "意气风发" },
            { spellId = 19577, name = "胁迫" },
            { spellId = 5116, name = "震荡射击" },
            { spellId = 19801, name = "宁神射击" },
            { spellId = 187698, name = "焦油陷进" },
            { spellId = 1513, name = "恐吓野兽" },
            { spellId = 109248, name = "束缚射击" },
            { spellId = 195645, name = "摔绊" },
            { spellId = 1261193, name = "爆裂火铳" },
            { spellId = 1250646, name = "狩魂一击" },
            { spellId = 190925, name = "鱼叉猛刺" },
            { spellId = 186270, name = "猛禽一击" },
            { spellId = 259495, name = "野火炸弹" },
        },
    },
}

Fuyutsui.spellsList = {
    [384255]  = { index = 151, },              -- 切换天赋
    [200749]  = { index = 152, },              -- 切换专精
    -- 种族（主动技能；同类技能多职业变体共用同一 index）
    [28730]   = { index = 101, },              -- 奥术洪流(法师)
    [25046]   = { index = 101, },              -- 奥术洪流(潜行者)
    [50613]   = { index = 101, },              -- 奥术洪流(死亡骑士)
    [69179]   = { index = 101, },              -- 奥术洪流(战士)
    [80483]   = { index = 101, },              -- 奥术洪流(猎人)
    [129597]  = { index = 101, },              -- 奥术洪流(武僧)
    [155145]  = { index = 101, },              -- 奥术洪流(恶魔猎手)
    [202719]  = { index = 101, },              -- 奥术洪流(恶魔猎手)
    [232633]  = { index = 101, },              -- 奥术洪流(牧师)
    [20594]   = { index = 102, },              -- 矮人：石像形态
    [58984]   = { index = 103, },              -- 暗夜精灵：影遁
    [26297]   = { index = 104, },              -- 巨魔：狂暴
    [20572]   = { index = 105, },              -- 兽人：血性狂怒(攻击强度)
    [33697]   = { index = 105, },              -- 兽人：血性狂怒(双属性)
    [33702]   = { index = 105, },              -- 兽人：血性狂怒(法术强度)
    [20549]   = { index = 106, },              -- 牛头人：战争践踏
    [59752]   = { index = 107, },              -- 人类：生存意志
    [7744]    = { index = 108, },              -- 亡灵：亡灵意志
    [20589]   = { index = 109, },              -- 侏儒：逃命专家
    [68992]   = { index = 110, },              -- 狼人：黑暗飞行
    [69070]   = { index = 111, },              -- 地精：火箭跳
    [69041]   = { index = 112, },              -- 地精：火箭弹幕
    [256948]  = { index = 113, },              -- 虚空精灵：空间裂隙
    [255647]  = { index = 114, },              -- 光铸德莱尼：圣光裁决
    [274738]  = { index = 115, },              -- 玛格汉兽人：先祖召唤
    [265221]  = { index = 116, },              -- 黑铁矮人：烈焰之血
    [255654]  = { index = 117, },              -- 高山牛头人：蛮牛冲撞
    [255723]  = { index = 117, },              -- 高山牛头人：蛮牛冲撞
    [260364]  = { index = 118, },              -- 夜之子：奥术脉冲
    [312411]  = { index = 119, },              -- 狐人：袋里乾坤
    [291944]  = { index = 120, },              -- 赞达拉巨魔：再生
    [107079]  = { index = 121, },              -- 熊猫人：震山掌
    [28880]   = { index = 122, },              -- 德莱尼：纳鲁的赐福(战士)
    [59542]   = { index = 122, },              -- 纳鲁的赐福(圣骑士)
    [59543]   = { index = 122, },              -- 纳鲁的赐福(猎人)
    [59544]   = { index = 122, },              -- 纳鲁的赐福(牧师)
    [59545]   = { index = 122, },              -- 纳鲁的赐福(死亡骑士)
    [59547]   = { index = 122, },              -- 纳鲁的赐福(萨满)
    [121093]  = { index = 122, },              -- 纳鲁的赐福(武僧)
    [287712]  = { index = 123, },              -- 库尔提拉斯人：重拳出击
    [312924]  = { index = 124, },              -- 机械侏儒：超有机光发起源
    [368970]  = { index = 125, },              -- 龙希尔：扫尾
    [357214]  = { index = 126, },              -- 龙希尔：翼击
    [436344]  = { index = 127, },              -- 土灵：艾泽里特涌动
    -- 猎人
    [217200]  = { index = 1, },                -- 倒刺射击
    [34026]   = { index = 2, },                -- 杀戮命令
    [193455]  = { index = 3, },                -- 眼镜蛇射击
    [19574]   = { index = 4, },                -- 狂野怒火
    [201430]  = { index = 5, },                -- 荒野呼唤
    [131894]  = { index = 6, },                -- 夺命黑鸦
    [120360]  = { index = 7, },                -- 弹幕射击
    [321530]  = { index = 8, },                -- 血溅十方
    [19434]   = { index = 9, },                -- 瞄准射击
    [257044]  = { index = 10, },               -- 急速射击
    [56641]   = { index = 11, },               -- 稳固射击
    [2643]    = { index = 12, },               -- 多重射击
    [288613]  = { index = 13, },               -- 百发百中
    [53351]   = { index = 14, },               -- 夺命射击
    [212431]  = { index = 15, },               -- 爆炸射击
    [389831]  = { index = 16, },               -- 哀恸箭
    [257284]  = { index = 17, },               -- 猎人印记
    [185358]  = { index = 18, },               -- 奥术射击
    [342049]  = { index = 19, },               -- 奇美拉射击
    [883]     = { index = 20, },               -- 召唤宠物1
    [1264359] = { index = 21, },               -- 狂野鞭笞
    [109304]  = { index = 22, failed = true }, -- 意气风发
    [186265]  = { index = 23, },               -- 灵龟守护
    [147362]  = { index = 24, },               -- 反制射击
    [392060]  = { index = 25, },               -- 哀恸箭
    [466930]  = { index = 26, },               -- 黑蚀箭
    [19577]   = { index = 27, failed = true }, -- 胁迫
    [260243]  = { index = 28, },               -- 乱射
    [257620]  = { index = 29, },               -- 多重射击
    [259489]  = { index = 30, },               -- 杀戮命令
    [193265]  = { index = 31, },               -- 投掷手斧
    [1251592] = { index = 32, },               -- 燎焰沥青
    [1261193] = { index = 33, },               -- 爆裂火铳
    [1250646] = { index = 34, },               -- 狩魂一击
    [190925]  = { index = 35, },               -- 鱼叉猛刺
    [186270]  = { index = 36, },               -- 猛禽一击
    [259495]  = { index = 37, },               -- 野火炸弹
    [53480]   = { index = 38, },               -- 牺牲咆哮
    [5116]    = { index = 39, failed = true }, -- 震荡射击
    [19801]   = { index = 40, failed = true }, -- 宁神射击
    [187698]  = { index = 41, failed = true }, -- 焦油陷进
    [1513]    = { index = 42, failed = true }, -- 恐吓野兽
    [109248]  = { index = 43, failed = true }, -- 束缚射击
    [199483]  = { index = 44, },               -- 伪装
    [195645]  = { index = 45, failed = true }, -- 摔绊
    [1262293] = { index = 46, },               -- 猛禽横扫
}
