if UnitClassBase("player") ~= "MAGE" then return end
local addon, ns = ...
Fuyutsui.ClassBlocks = {
    [1] = {
        states = {
            ["状态"] = {
                "锚点",
                "职业",
                "专精",
                "队伍类型",
                "英雄天赋",
                "有效性",
                "一键辅助",
                "法术失败",
                "战斗时间",
                "移动",
                "施法",
                "引导",
                "蓄力",
                "蓄力层数",
                "生命值",
                "法力值",
                "队伍人数",
                "首领战",
                "难度",
            },
            ["目标"] = {
                "类型",
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
            ["焦点"] = {
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
        },
    },
    [2] = {
        states = {
            ["状态"] = {
                "锚点",
                "职业",
                "专精",
                "队伍类型",
                "英雄天赋",
                "有效性",
                "一键辅助",
                "法术失败",
                "战斗时间",
                "移动",
                "施法",
                "引导",
                "蓄力",
                "蓄力层数",
                "生命值",
                "法力值",
                "队伍人数",
                "首领战",
                "难度",
            },
            ["目标"] = {
                "类型",
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
            ["焦点"] = {
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
        },
    },
    [3] = {
        states = {
            ["状态"] = {
                "锚点",
                "职业",
                "专精",
                "队伍类型",
                "英雄天赋",
                "有效性",
                "一键辅助",
                "法术失败",
                "战斗时间",
                "移动",
                "施法",
                "引导",
                "蓄力",
                "蓄力层数",
                "生命值",
                "法力值",
                "队伍人数",
                "首领战",
                "难度",
                "施法技能",
                "敌人人数",
            },
            ["目标"] = {
                "类型",
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
            ["焦点"] = {
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
        },
        -- TODO spellId: 热能真空
        -- TODO spellId: 冰川尖刺！
        -- TODO spellId: 冰冷智慧
        -- TODO spellId: 冰冻之雨
        -- TODO spellId: 寒冰指
        -- TODO spellId: 寒冰指层数
    },
}

Fuyutsui.spellsList = {

    [384255]  = { index = 151, },              -- 切换天赋
    [200749]  = { index = 152, },              -- 切换专精
    -- 种族
    [59547]   = { index = 122, },              -- 纳鲁的赐福
    [28730]   = { index = 101, },              -- 奥术洪流(法师)
    [232633]  = { index = 101, },              -- 奥术洪流(牧师)
    [129597]  = { index = 101, },              -- 奥术洪流(武僧)
    -- 法师
    [45438]   = { index = 1, },                -- 寒冰屏障
    [475]     = { index = 2, },                -- 解除诅咒
    [110960]  = { index = 3, },                -- 强化隐形术
    [157980]  = { index = 4, },                -- 超级新星
    [120]     = { index = 5, },                -- 冰锥术
    [342247]  = { index = 6, },                -- 操控时间
    [371817]  = { index = 7, },                -- 回归
    [80353]   = { index = 8, },                -- 时间扭曲
    [55342]   = { index = 9, },                -- 镜像
    [2139]    = { index = 10, },               -- 法术反制
    [1953]    = { index = 11, },               -- 闪现术
    [130]     = { index = 12, },               -- 缓落术
    [1449]    = { index = 13, },               -- 魔爆术
    [157997]  = { index = 14, },               -- 寒冰新星
    [212653]  = { index = 15, },               -- 闪光术
    [62388]   = { index = 16, },               -- 传送距离
    [389713]  = { index = 17, },               -- 闪回
    [110959]  = { index = 18, failed = true }, -- 强化隐形术
    [122]     = { index = 19, failed = true }, -- 冰霜新星
    [31661]   = { index = 20, failed = true }, -- 龙息术
    [414664]  = { index = 21, },               -- 群体隐形
    [30449]   = { index = 22, },               -- 法术吸取
    [1248829] = { index = 23, },               -- 暴风雪
    [190356]  = { index = 24, },               -- 暴风雪
    [1459]    = { index = 25, },               -- 奥术智慧
    [116]     = { index = 26, },               -- 寒冰箭
    [199786]  = { index = 27, },               -- 冰川尖刺
    [30455]   = { index = 28, },               -- 冰枪术
    [205021]  = { index = 29, },               -- 冰霜射线
    [44614]   = { index = 30, },               -- 冰风暴
    [84714]   = { index = 31, },               -- 寒冰宝珠
    [431044]  = { index = 32, },               -- 霜火之箭
    [153595]  = { index = 33, },               -- 彗星风暴
    [235215]  = { index = 34, },               -- 急速冷却
    [235450]  = { index = 35, },               -- 棱光护体
    [1241462] = { index = 36, },               -- 奥术脉冲
    [44425]   = { index = 37, },               -- 奥术弹幕
    [321507]  = { index = 38, },               -- 大法师之触
    [5143]    = { index = 39, },               -- 奥术飞弹
    [30451]   = { index = 40, },               -- 奥术冲击
    [153626]  = { index = 41, },               -- 奥术宝珠
    [365350]  = { index = 42, },               -- 奥术涌动
    [235313]  = { index = 43, },               -- 烈焰护体
    [414658]  = { index = 44, },               -- 深寒凝冰
    [190319]  = { index = 45, },               -- 燃烧
    [153561]  = { index = 46, },               -- 流星
    [133]     = { index = 47, },               -- 火球术
    [108853]  = { index = 48, },               -- 火焰冲击
    [11366]   = { index = 49, },               -- 炎爆术
    [1254851] = { index = 50, },               -- 烈焰风暴
    [118]     = { index = 51, },               -- 变形术
    [468655]  = { index = 52, },               -- 霜火之箭
    [2120]    = { index = 53, },               -- 烈焰风暴
    [2948]    = { index = 54, },               -- 灼烧
    [190336]  = { index = 55, },               -- 造餐术
}
