if UnitClassBase("player") ~= "MAGE" then return end
local addon, ns = ...
Fuyutsui.ClassBlocks = {
    [1] = {
        states = {
            ["状态"] = {
                "锚点",
                "职业",
                "专精",
                "队伍类型",
                "英雄天赋",
                "有效性",
                "一键辅助",
                "法术失败",
                "战斗时间",
                "移动",
                "施法",
                "引导",
                "蓄力",
                "蓄力层数",
                "生命值",
                "法力值",
                "队伍人数",
                "首领战",
                "难度",
            },
            ["目标"] = {
                "类型",
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
            ["焦点"] = {
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
        },
    },
    [2] = {
        states = {
            ["状态"] = {
                "锚点",
                "职业",
                "专精",
                "队伍类型",
                "英雄天赋",
                "有效性",
                "一键辅助",
                "法术失败",
                "战斗时间",
                "移动",
                "施法",
                "引导",
                "蓄力",
                "蓄力层数",
                "生命值",
                "法力值",
                "队伍人数",
                "首领战",
                "难度",
            },
            ["目标"] = {
                "类型",
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
            ["焦点"] = {
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
        },
    },
    [3] = {
        states = {
            ["状态"] = {
                "锚点",
                "职业",
                "专精",
                "队伍类型",
                "英雄天赋",
                "有效性",
                "一键辅助",
                "法术失败",
                "战斗时间",
                "移动",
                "施法",
                "引导",
                "蓄力",
                "蓄力层数",
                "生命值",
                "法力值",
                "队伍人数",
                "首领战",
                "难度",
                "施法技能",
                "敌人人数",
            },
            ["目标"] = {
                "类型",
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
            ["焦点"] = {
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
        },
        -- TODO spellId: 热能真空
        -- TODO spellId: 冰川尖刺！
        -- TODO spellId: 冰冷智慧
        -- TODO spellId: 冰冻之雨
        -- TODO spellId: 寒冰指
        -- TODO spellId: 寒冰指层数
    },
}

Fuyutsui.spellsList = {
    [384255]  = { index = 151, },              -- 切换天赋
    [200749]  = { index = 152, },              -- 切换专精
    -- 种族（主动技能；同类技能多职业变体共用同一 index）
    [28730]   = { index = 101, },              -- 奥术洪流(法师)
    [25046]   = { index = 101, },              -- 奥术洪流(潜行者)
    [50613]   = { index = 101, },              -- 奥术洪流(死亡骑士)
    [69179]   = { index = 101, },              -- 奥术洪流(战士)
    [80483]   = { index = 101, },              -- 奥术洪流(猎人)
    [129597]  = { index = 101, },              -- 奥术洪流(武僧)
    [155145]  = { index = 101, },              -- 奥术洪流(恶魔猎手)
    [202719]  = { index = 101, },              -- 奥术洪流(恶魔猎手)
    [232633]  = { index = 101, },              -- 奥术洪流(牧师)
    [20594]   = { index = 102, },              -- 矮人：石像形态
    [58984]   = { index = 103, },              -- 暗夜精灵：影遁
    [26297]   = { index = 104, },              -- 巨魔：狂暴
    [20572]   = { index = 105, },              -- 兽人：血性狂怒(攻击强度)
    [33697]   = { index = 105, },              -- 兽人：血性狂怒(双属性)
    [33702]   = { index = 105, },              -- 兽人：血性狂怒(法术强度)
    [20549]   = { index = 106, },              -- 牛头人：战争践踏
    [59752]   = { index = 107, },              -- 人类：生存意志
    [7744]    = { index = 108, },              -- 亡灵：亡灵意志
    [20589]   = { index = 109, },              -- 侏儒：逃命专家
    [68992]   = { index = 110, },              -- 狼人：黑暗飞行
    [69070]   = { index = 111, },              -- 地精：火箭跳
    [69041]   = { index = 112, },              -- 地精：火箭弹幕
    [256948]  = { index = 113, },              -- 虚空精灵：空间裂隙
    [255647]  = { index = 114, },              -- 光铸德莱尼：圣光裁决
    [274738]  = { index = 115, },              -- 玛格汉兽人：先祖召唤
    [265221]  = { index = 116, },              -- 黑铁矮人：烈焰之血
    [255654]  = { index = 117, },              -- 高山牛头人：蛮牛冲撞
    [255723]  = { index = 117, },              -- 高山牛头人：蛮牛冲撞
    [260364]  = { index = 118, },              -- 夜之子：奥术脉冲
    [312411]  = { index = 119, },              -- 狐人：袋里乾坤
    [291944]  = { index = 120, },              -- 赞达拉巨魔：再生
    [107079]  = { index = 121, },              -- 熊猫人：震山掌
    [28880]   = { index = 122, },              -- 德莱尼：纳鲁的赐福(战士)
    [59542]   = { index = 122, },              -- 纳鲁的赐福(圣骑士)
    [59543]   = { index = 122, },              -- 纳鲁的赐福(猎人)
    [59544]   = { index = 122, },              -- 纳鲁的赐福(牧师)
    [59545]   = { index = 122, },              -- 纳鲁的赐福(死亡骑士)
    [59547]   = { index = 122, },              -- 纳鲁的赐福(萨满)
    [121093]  = { index = 122, },              -- 纳鲁的赐福(武僧)
    [287712]  = { index = 123, },              -- 库尔提拉斯人：重拳出击
    [312924]  = { index = 124, },              -- 机械侏儒：超有机光发起源
    [368970]  = { index = 125, },              -- 龙希尔：扫尾
    [357214]  = { index = 126, },              -- 龙希尔：翼击
    [436344]  = { index = 127, },              -- 土灵：艾泽里特涌动
    -- 法师
    [45438]   = { index = 1, },                -- 寒冰屏障
    [475]     = { index = 2, },                -- 解除诅咒
    [110960]  = { index = 3, },                -- 强化隐形术
    [157980]  = { index = 4, },                -- 超级新星
    [120]     = { index = 5, },                -- 冰锥术
    [342247]  = { index = 6, },                -- 操控时间
    [371817]  = { index = 7, },                -- 回归
    [80353]   = { index = 8, },                -- 时间扭曲
    [55342]   = { index = 9, },                -- 镜像
    [2139]    = { index = 10, },               -- 法术反制
    [1953]    = { index = 11, },               -- 闪现术
    [130]     = { index = 12, },               -- 缓落术
    [1449]    = { index = 13, },               -- 魔爆术
    [157997]  = { index = 14, },               -- 寒冰新星
    [212653]  = { index = 15, },               -- 闪光术
    [62388]   = { index = 16, },               -- 传送距离
    [389713]  = { index = 17, },               -- 闪回
    [110959]  = { index = 18, failed = true }, -- 强化隐形术
    [122]     = { index = 19, failed = true }, -- 冰霜新星
    [31661]   = { index = 20, failed = true }, -- 龙息术
    [414664]  = { index = 21, },               -- 群体隐形
    [30449]   = { index = 22, },               -- 法术吸取
    [1248829] = { index = 23, },               -- 暴风雪
    [190356]  = { index = 24, },               -- 暴风雪
    [1459]    = { index = 25, },               -- 奥术智慧
    [116]     = { index = 26, },               -- 寒冰箭
    [199786]  = { index = 27, },               -- 冰川尖刺
    [30455]   = { index = 28, },               -- 冰枪术
    [205021]  = { index = 29, },               -- 冰霜射线
    [44614]   = { index = 30, },               -- 冰风暴
    [84714]   = { index = 31, },               -- 寒冰宝珠
    [431044]  = { index = 32, },               -- 霜火之箭
    [153595]  = { index = 33, },               -- 彗星风暴
    [235215]  = { index = 34, },               -- 急速冷却
    [235450]  = { index = 35, },               -- 棱光护体
    [1241462] = { index = 36, },               -- 奥术脉冲
    [44425]   = { index = 37, },               -- 奥术弹幕
    [321507]  = { index = 38, },               -- 大法师之触
    [5143]    = { index = 39, },               -- 奥术飞弹
    [30451]   = { index = 40, },               -- 奥术冲击
    [153626]  = { index = 41, },               -- 奥术宝珠
    [365350]  = { index = 42, },               -- 奥术涌动
    [235313]  = { index = 43, },               -- 烈焰护体
    [414658]  = { index = 44, },               -- 深寒凝冰
    [190319]  = { index = 45, },               -- 燃烧
    [153561]  = { index = 46, },               -- 流星
    [133]     = { index = 47, },               -- 火球术
    [108853]  = { index = 48, },               -- 火焰冲击
    [11366]   = { index = 49, },               -- 炎爆术
    [1254851] = { index = 50, },               -- 烈焰风暴
    [118]     = { index = 51, },               -- 变形术
    [468655]  = { index = 52, },               -- 霜火之箭
    [2120]    = { index = 53, },               -- 烈焰风暴
    [2948]    = { index = 54, },               -- 灼烧
    [190336]  = { index = 55, },               -- 造餐术
}
