if UnitClassBase("player") ~= "WARRIOR" then return end
local addon, ns = ...
Fuyutsui.ClassBlocks = {
    [1] = {
        states = {
            ["状态"] = {
                "锚点",
                "职业",
                "专精",
                "队伍类型",
                "英雄天赋",
                "有效性",
                "一键辅助",
                "法术失败",
                "战斗时间",
                "移动",
                "生命值",
                "怒气值",
                "队伍人数",
                "首领战",
                "难度",
                "敌人人数",
            },
            ["目标"] = {
                "类型",
                "生命值",
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
            ["焦点"] = {
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
        },
        -- TODO spellId: 斩杀高亮
        -- TODO spellId: 英勇打击高亮
        -- TODO spellId: 顺劈斩高亮
        -- TODO spellId: 致死高亮
        spells = {
            { spellId = 202168, name = "胜利在望" },
            { spellId = 376079, name = "勇士之矛" },
            { spellId = 6544, name = "英勇飞跃" },
            { spellId = 97462, name = "集结呐喊" },
            { spellId = 46968, name = "震荡波" },
            { spellId = 107570, name = "风暴之锤" },
            { spellId = 384110, name = "破裂投掷" },
            { spellId = 64382, name = "碎裂投掷" },
            { spellId = 5246, name = "破胆怒吼" },
            { spellId = 7384, name = "压制" },
            { spellId = 7384, name = "压制", charge = true },
            { spellId = 163201, name = "斩杀" },
            { spellId = 845, name = "顺劈斩" },
            { spellId = 12294, name = "致死打击" },
            { spellId = 167105, name = "巨人打击" },
            { spellId = 436358, name = "崩摧" },
            { spellId = 6552, name = "拳击" },
        },
    },
    [2] = {
        states = {
            ["状态"] = {
                "锚点",
                "职业",
                "专精",
                "队伍类型",
                "英雄天赋",
                "有效性",
                "一键辅助",
                "法术失败",
                "战斗时间",
                "移动",
                "生命值",
                "怒气值",
                "队伍人数",
                "首领战",
                "难度",
                "敌人人数",
            },
            ["目标"] = {
                "类型",
                "生命值",
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
            ["焦点"] = {
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
        },
        spells = {
            { spellId = 202168, name = "胜利在望" },
            { spellId = 376079, name = "勇士之矛" },
            { spellId = 6544, name = "英勇飞跃" },
            { spellId = 97462, name = "集结呐喊" },
            { spellId = 46968, name = "震荡波" },
            { spellId = 107570, name = "风暴之锤" },
            { spellId = 384110, name = "破裂投掷" },
            { spellId = 64382, name = "碎裂投掷" },
            { spellId = 5246, name = "破胆怒吼" },
            { spellId = 1719, name = "鲁莽" },
            { spellId = 6552, name = "拳击" },
        },
    },
    [3] = {
        states = {
            ["状态"] = {
                "锚点",
                "职业",
                "专精",
                "队伍类型",
                "英雄天赋",
                "有效性",
                "一键辅助",
                "法术失败",
                "战斗时间",
                "移动",
                "生命值",
                "怒气值",
                "队伍人数",
                "首领战",
                "难度",
                "敌人人数",
            },
            ["目标"] = {
                "类型",
                "生命值",
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
            ["焦点"] = {
                "施法",
                "施法可打断",
                "引导",
                "引导可打断",
            },
        },
        -- TODO spellId: 盾牌格挡
        spells = {
            { spellId = 202168, name = "胜利在望" },
            { spellId = 376079, name = "勇士之矛" },
            { spellId = 6544, name = "英勇飞跃" },
            { spellId = 97462, name = "集结呐喊" },
            { spellId = 46968, name = "震荡波" },
            { spellId = 107570, name = "风暴之锤" },
            { spellId = 384110, name = "破裂投掷" },
            { spellId = 64382, name = "碎裂投掷" },
            { spellId = 5246, name = "破胆怒吼" },
            { spellId = 2565, name = "盾牌格挡" },
            { spellId = 2565, name = "盾牌格挡", charge = true },
            { spellId = 385952, name = "盾牌冲锋" },
            { spellId = 107574, name = "天神下凡" },
            { spellId = 1160, name = "挫志怒吼" },
            { spellId = 6552, name = "拳击" },
            { spellId = 190456, name = "无视苦痛" },
        },
    },
}

Fuyutsui.spellsList = {
    [384255]  = { index = 151, },              -- 切换天赋
    [200749]  = { index = 152, },              -- 切换专精
    -- 种族（主动技能；同类技能多职业变体共用同一 index）
    [28730]   = { index = 101, },              -- 奥术洪流(法师)
    [25046]   = { index = 101, },              -- 奥术洪流(潜行者)
    [50613]   = { index = 101, },              -- 奥术洪流(死亡骑士)
    [69179]   = { index = 101, },              -- 奥术洪流(战士)
    [80483]   = { index = 101, },              -- 奥术洪流(猎人)
    [129597]  = { index = 101, },              -- 奥术洪流(武僧)
    [155145]  = { index = 101, },              -- 奥术洪流(恶魔猎手)
    [202719]  = { index = 101, },              -- 奥术洪流(恶魔猎手)
    [232633]  = { index = 101, },              -- 奥术洪流(牧师)
    [20594]   = { index = 102, },              -- 矮人：石像形态
    [58984]   = { index = 103, },              -- 暗夜精灵：影遁
    [26297]   = { index = 104, },              -- 巨魔：狂暴
    [20572]   = { index = 105, },              -- 兽人：血性狂怒(攻击强度)
    [33697]   = { index = 105, },              -- 兽人：血性狂怒(双属性)
    [33702]   = { index = 105, },              -- 兽人：血性狂怒(法术强度)
    [20549]   = { index = 106, },              -- 牛头人：战争践踏
    [59752]   = { index = 107, },              -- 人类：生存意志
    [7744]    = { index = 108, },              -- 亡灵：亡灵意志
    [20589]   = { index = 109, },              -- 侏儒：逃命专家
    [68992]   = { index = 110, },              -- 狼人：黑暗飞行
    [69070]   = { index = 111, },              -- 地精：火箭跳
    [69041]   = { index = 112, },              -- 地精：火箭弹幕
    [256948]  = { index = 113, },              -- 虚空精灵：空间裂隙
    [255647]  = { index = 114, },              -- 光铸德莱尼：圣光裁决
    [274738]  = { index = 115, },              -- 玛格汉兽人：先祖召唤
    [265221]  = { index = 116, },              -- 黑铁矮人：烈焰之血
    [255654]  = { index = 117, },              -- 高山牛头人：蛮牛冲撞
    [255723]  = { index = 117, },              -- 高山牛头人：蛮牛冲撞
    [260364]  = { index = 118, },              -- 夜之子：奥术脉冲
    [312411]  = { index = 119, },              -- 狐人：袋里乾坤
    [291944]  = { index = 120, },              -- 赞达拉巨魔：再生
    [107079]  = { index = 121, },              -- 熊猫人：震山掌
    [28880]   = { index = 122, },              -- 德莱尼：纳鲁的赐福(战士)
    [59542]   = { index = 122, },              -- 纳鲁的赐福(圣骑士)
    [59543]   = { index = 122, },              -- 纳鲁的赐福(猎人)
    [59544]   = { index = 122, },              -- 纳鲁的赐福(牧师)
    [59545]   = { index = 122, },              -- 纳鲁的赐福(死亡骑士)
    [59547]   = { index = 122, },              -- 纳鲁的赐福(萨满)
    [121093]  = { index = 122, },              -- 纳鲁的赐福(武僧)
    [287712]  = { index = 123, },              -- 库尔提拉斯人：重拳出击
    [312924]  = { index = 124, },              -- 机械侏儒：超有机光发起源
    [368970]  = { index = 125, },              -- 龙希尔：扫尾
    [357214]  = { index = 126, },              -- 龙希尔：翼击
    [436344]  = { index = 127, },              -- 土灵：艾泽里特涌动
    -- 战士
    [202168]  = { index = 1, failed = true },  -- 胜利在望
    [376079]  = { index = 2, failed = true },  -- 勇士之矛
    [6544]    = { index = 3, failed = true },  -- 英勇飞跃
    [97462]   = { index = 4, failed = true },  -- 集结呐喊
    [46968]   = { index = 5, failed = true },  -- 震荡波
    [107570]  = { index = 6, failed = true },  -- 风暴之锤
    [384110]  = { index = 7, failed = true },  -- 破裂投掷
    [64382]   = { index = 8, failed = true },  -- 碎裂投掷
    [5246]    = { index = 9, failed = true },  -- 破胆怒吼
    [385952]  = { index = 10, failed = true }, -- 盾牌冲锋
    [57755]   = { index = 11, },               -- 英勇投掷
    [6673]    = { index = 12, },               -- 战斗怒吼
    [1464]    = { index = 13, },               -- 猛击
    [772]     = { index = 14, },               -- 撕裂
    [281000]  = { index = 15, },               -- 斩杀
    [227847]  = { index = 16, },               -- 剑刃风暴
    [436358]  = { index = 17, },               -- 崩摧
    [12294]   = { index = 18, },               -- 致死打击
    [167105]  = { index = 19, },               -- 巨人打击
    [845]     = { index = 20, },               -- 顺劈斩
    [7384]    = { index = 21, },               -- 压制
    [260708]  = { index = 22, },               -- 横扫攻击
    [107574]  = { index = 23, },               -- 天神下凡
    [190411]  = { index = 24, },               -- 旋风斩
    [5308]    = { index = 25, },               -- 斩杀
    [23881]   = { index = 26, },               -- 嗜血
    [184367]  = { index = 27, },               -- 暴怒
    [385059]  = { index = 28, },               -- 奥丁之怒
    [85288]   = { index = 29, },               -- 怒击
    [6343]    = { index = 30, },               -- 雷霆一击
    [435222]  = { index = 31, },               -- 雷霆轰击
    [6572]    = { index = 32, },               -- 复仇
    [23922]   = { index = 33, },               -- 盾牌猛击
    [163201]  = { index = 34, },               -- 斩杀
    [1269383] = { index = 35, },               -- 英勇打击
    [335096]  = { index = 36, },               -- 浴血奋战
    [335100]  = { index = 37, },               -- 碎甲猛击
    [228920]  = { index = 38, },               -- 破坏者
    [280735]  = { index = 39, },               -- 斩杀（点了屠杀天赋）
}
